#encoding: utf-8
module ApplicationHelper
  def safe_image_tag(source, default_source, options = {})
    if source == nil || source.size == 0
      source = default_source
    end
    image_tag(source, options)
  end


  PROVINCES = ["北京", "天津", "河北", "山西", "内蒙", "辽宁", "吉林", 
               "黑龙江", "上海", "江苏", "浙江", "安徽", "福建", "江西", 
               "山东", "河南", "湖北", "湖南", "广东", "广西", "海南", "重庆", 
               "四川", "贵州", "云南", "西藏","陕西", "甘肃", "青海", "宁夏", 
               "新疆", "香港", "澳门", "台湾"]

  PERSONAL_STYLE=['帅气','阳光','聪明','大度','才华','漂亮','可爱','乐观','稳重',
                  '活泼','内向','开朗','进取','幽默','正直','善良','洒脱','热心',
                  '豪爽','坦诚','坚强','柔情','憨厚']

  INVITATION_TYPE=[['聚会','juhui'],['运动','yundong'],['桌游','zhuoyou'],['旅行','lvxing'],
                   ['电影','dianying'],['公益','gongyi'],['音乐','yingyue'],['展览','zhanlan'],
                   ['戏剧','xiju'],['讲座','jiangzuo'],['其他','qita']]

=begin
  CITIES = ["北京市", "天津市", "上海市", "重庆市","辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市", "唐山市", "遵化市", "迁安市", 
      "邯郸市", "武安市", "邢台市", "南宫市", "沙河市", " 保定市", "涿州市", "定州市", "安国市", 
      "承德市", "沧州市", "泊头市", "任丘市", "黄骅市", "河间市", "廊坊市", "霸州市", "三河市", 
      "衡水市", "冀州市", "深州市", "石家庄市", "张家口市", "高碑店市", "秦皇岛市", "太原市", "古交市",
      "大同市", "阳泉市", "长治市", "潞城市", "晋城市", "高平市", "朔州市", "晋中市", "介休市", "运城市", 
      "河津市", "永济市", "忻州市", "原平市", "临汾市", "侯马市", "霍州市", "吕梁市", "孝义市", "汾阳市", 
      "包头市", "乌海市", "赤峰市", "通辽市", "根河市", "丰镇市", "满洲里市", "牙克石市", "扎兰屯市", "阿尔山市", 
      "呼和浩特市", "霍林郭勒市", "鄂尔多斯市", "呼伦贝尔市", "额尔古纳市", "巴彦淖尔市", "乌兰察布市", "锡林浩特市", 
      "二连浩特市", "乌兰浩特市", "沈阳市", "新民市", "大连市", "庄河市", "鞍山市", "海城市", "抚顺市", "本溪市", 
      "丹东市", "东港市", "凤城市", "锦州市", "凌海市", "北宁市", "营口市", "盖州市", "阜新市", "辽阳市", "灯塔市", 
      "盘锦市", "铁岭市", "开原市", "朝阳市", "凌源市", "北票市", "兴城市", "大石桥市", "瓦房店市", "普兰店市", "调兵山市", 
      "葫芦岛市", "长春市", "九台市", "榆树市", "德惠市", "吉林市", "舒兰市", "桦甸市", "蛟河市", "磐石市", "四平市", "双辽市", 
      "辽源市", "通化市", "集安市", "白山市", "临江市", "松原市", "白城市", "大安市", "洮南市", "延吉市", "图们市", "敦化市",
      "龙井市", "珲春市", "和龙市", "公主岭市", "梅河口市", "阿城市", "尚志市", "双城市", "五常市", "讷河市", "鹤岗市", "鸡西市", 
      "密山市", "虎林市", "大庆市", "伊春市", "铁力市", "宁安市", "海林市", "穆棱市", " 同江市", "富锦市", "黑河市", "北安市", 
      "绥化市", "安达市", "肇东市", "海伦市", "七台河市", "双鸭山市", "牡丹江市", "佳木斯市", "绥芬河市", "哈尔滨市", "齐齐哈尔市",
      "五大连池市", "南京市", "无锡市", "江阴市", "宜兴市", "徐州市", "邳州市", "新沂市", "常州市", "金坛市", "溧阳市", "苏州市", 
      "常熟市", "太仓市", "昆山市", "吴江市", "南通市", "如皋市", "通州市", "海门市", "启东市", "淮安市", "盐城市", "东台市", "大丰市",
      "扬州市", "高邮市", "江都市", "仪征市", "镇江市", "丹阳市", "扬中市", "句容市", "泰州市", "泰兴市", "姜堰市", "靖江市", "兴化市",
      "宿迁市", "连云港市", "张家港市", "杭州市", "建德市", "富阳市", "临安市", "宁波市", " 余姚市", "慈溪市", "奉化市", "温州市", "瑞安市", 
      "乐清市", "嘉兴市", "海宁市", "平湖市", "桐乡市", "湖州市", "绍兴市", "诸暨市", "上虞市", "嵊州市", "金华市", "兰溪市", "义乌市", "东阳市",
      "永康市", "衢州市", "江山市", "舟山市", "台州市", "临海市", "丽水市", "龙泉市", "合肥市", "芜湖市", "蚌埠市", "淮南市", "淮北市", "铜陵市",
      "安庆市", "桐城市", "黄山市", "滁州市", "天长市", "明光市", "阜阳市", "界首市", "宿州市", "巢湖市", "六安市", "亳州市", "池州市", "宣城市",
      "宁国市", "马鞍山市", "福州市", "福清市", "长乐市", "厦门市", "莆田市", "三明市", "永安市", "泉州市", "石狮市", "晋江市", "南安市", "漳州市", 
      "龙海市", "南平市", "建瓯市", "邵武市", "建阳市", "龙岩市", "漳平市", "南昌市", "乐平市", "萍乡市", "九江市", "瑞昌市", "新余市", "鹰潭市", "贵溪市",
      "赣州市", "瑞金市", "南康市", "吉 安市", "宜春市", "丰城市", "樟树市", "高安市", "抚州市", "上饶市", "德兴市", "井冈山市", "景德镇市", "济南市", "章丘市",
      "青岛市", "胶南市", "胶州市", "平度市", "莱西市", "即墨市", "淄博市", "枣庄市", "滕州市", "烟台市", "龙口市", "莱阳市", "莱州市", "招远市", "蓬莱市", "栖霞市", 
      "海阳市", "潍坊市", "青州市", "诸城市", "寿光市", "安丘市", "高密市", "昌邑市", "济宁市", "曲阜市", "兖州市", "邹城市", "泰安市", "新泰市", "肥城市", "威海市", 
      "乳山市", "文登市", "荣成市", "日照 市", "莱芜市", "临沂市", "德州市", "乐陵市", "禹城市", "聊城市", "临清市", "滨州市", "菏泽市", "郑州市", "巩义市", "新郑市", 
      "新密市", "登封市", "荥阳市", "开 封市", "洛阳市", "偃师市", "汝州市", "舞钢市", "安阳市", "林州市", "鹤壁市", "新乡市", "卫辉市", "辉县市", "焦作市", "沁阳市", 
      "孟州市", "濮阳市", "许昌市", " 禹州市", "长葛市", "漯河市", "义马市", "灵宝市", "南阳市", "邓州市", "商丘市", "永城市", "信阳市", "周口市", "项城市", "济源市", 
      "三门峡市", "平顶山市", "驻马 店市", "武汉市", "黄石市", "大冶市", "十堰市", "荆州市", "洪湖市", "石首市", "松滋市", "宜昌市", "宜都市", "当阳市", "枝江市", "襄樊市", 
      "枣阳市", "宜城市", " 鄂州市", "荆门市", "钟祥市", "孝感市", "应城市", "安陆市", "汉川市", "黄冈市", "麻城市", "武穴市", "咸宁市", "赤壁市", "随州市", "广水市", "仙桃市", 
      "天门市", "潜江市", "恩施市", "利川市", "丹江口市", "老河口市", "长沙市", "浏阳市", "株洲市", "醴陵市", "湘潭市", "湘乡市", "韶山市", "衡阳市", "耒阳市", "常宁市", "邵阳市", 
      "武冈市", "岳阳市", "临湘市", "汨罗市", "常德市", "津市市", "益阳市", "沅江市", "郴州市", "资兴市", "永州市", "怀化市", "洪江市", "娄底市", "涟源市", "吉 首市", "冷水江市", 
      "张家界市", "广州市", "从化市", "增城市", "深圳市", "珠海市", "汕头市", "韶关市", "乐昌市", "南雄市", "佛山市", "江门市", "台山市", "开平市", "鹤山市", "恩平市", "湛江市",
      "廉江市", "雷州市", "吴川市", "茂名市", "高州市", "化州市", "信宜市", "肇庆市", "高要市", "四会市", "惠州市", "梅州市", "兴宁市", "汕尾市", "陆丰市", "河源市", "阳江市", "阳春市", 
      "清远市", "英德市", "连州市", "东莞市", "中山市", "潮州市", "揭阳市", "普宁市", "云浮市", "罗定市", "南宁 市", "柳州市", "桂林市", "梧州市", "岑溪市", "北海市", "东兴市", "钦州市",
      "贵港市", "桂平市", "玉林市", "北流市", "百色市", "贺州市", "河池市", "宜州市", "来 宾市", "合山市", "崇左市", "凭祥市", "防城港市", "海口市", "琼海市", "儋州市", "文昌市", "万宁市", 
      "东方市", "三亚市", "五指山市", ",永川市", "合川市", "江津市", "南川市", "成都市", "彭州市", "邛崃市", "崇州市", "自贡市", "泸州市", "德阳市", "广汉市", "什邡市", "绵竹市", "绵阳市", 
      "江油市", "广元市", "遂宁市", "内江 市", "乐山市", "南充市", "阆中市", "眉山市", "宜宾市", "广安市", "华蓥市", "达州市", "万源市", "雅安市", "巴中市", "资阳市", "简阳市", "西昌市", 
      "峨眉山市", " 都江堰市", "攀枝花市", "贵阳市", "清镇市", "遵义市", "赤水市", "仁怀市", "安顺市", "毕节市", "兴义市", "凯里市", "都匀市", "福泉市", "六盘水市", "关岭布依族苗 族自治县铜仁市", 
      "贵阳市", "清镇市", "遵义市", "赤水市", "仁怀市", "安顺市", "毕节市", "兴义市", "凯里市", "都匀市", "福泉市", "六盘水市", "关岭布依族苗族自治 县铜仁市", "贵阳市", "清镇市", "遵义市", "赤水市", 
      "仁怀市", "安顺市", "毕节市", "兴义市", "凯里市", "都匀市", "福泉市", "六盘水市", "关岭布依族苗族自治县铜仁 市", "西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "韩城市", "华阴市", "延安市", 
      "汉中市", "榆林市", "安康市", "商洛市", "西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "韩城市", "华阴市", "延安市", "汉中市", "榆林市", "安康市", "商洛市", "西宁市", "德令哈市", "格尔木市", 
      "银川市", "灵武市", "吴忠市", "固原市", "中卫市", "石嘴山市", "青铜峡市", "哈密市", "和田市", "喀什市", "昌吉市", "阜康市", "米泉市", "博乐市", "伊宁市", "奎屯市", "塔城市", "乌苏市", ",石河子市",
      "阿拉尔市", "五家渠市", "吐鲁番市", "阿克苏市", "阿图什市", "库尔勒市", ",阿勒泰市", "乌鲁木齐市", "克拉玛依市", "图木舒克市", "台北市", "高雄市", "基隆市", " 台中市", "台南市", "新竹市", "嘉义市", "板桥市", 
      "宜兰市", "竹北市", "桃园市", "苗栗市", "丰原市", "彰化市", "南投市", "太保市", "斗六市", "新营市", "凤山市", "屏东市", "台东市", "花莲市", "马公市"]

=end
  CITIES = ['北京','上海','长沙','西安','武汉','杭州','南京','成都','厦门','广州','深圳']
  HOBBIES = ['篮球', '羽毛球', '吉他', '钢琴', '画画', 'K歌','听音乐',
             '旅游','桌游','电玩','游戏','看书','看电影','摄影','动漫',
             '跑步','自行车','游泳','乒乓球','登山','足球','网球','街舞',
             '武术','排球','瑜伽','健美操','桌球','滑雪']

  def str_to_array(str)
    arr = [""]
    arr[1..str.split(',').size] = str.split(',')
    arr
  end

  def store_location
    session[:return_to] = request.fullpath
  end

  def redirect_back_or(default)
    redirect_to(session[:return_to] || default)
    session.delete(:return_to)
  end

end
